Revit 2026 API

# MemberForcesForce Property

---

The translational forces at relative point position of the element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Force { get; set; }
```
```vb
Public Property Force As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Force {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member Force : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The x value of XYZ object represents moment about x-axis of the analytical element coordinate system, y about y-axis, z about z-axis respectively.

#### Reference

MemberForces Class

Autodesk.Revit.DB.Structure Namespace